99_Cats_Project/ninety_nine_cats/app/controllers/cats_controller.rb

  def create
    @cat = Cat.new(cats_params)
    if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @cat = Cat.find_by(id: params[:id])
    if @cat.update(cats_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["birth_date", "2020-06-27"], ["updated_at", "2020-10-09 21:16:22.543639"], ["id", 4]]